Revit 2027 API
ParameterTypeId.RoofRafterOrTrussParam Property
 "Rafter or Truss"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofRafterOrTrussParam { get; }
Public Shared ReadOnly Property RoofRafterOrTrussParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofRafterOrTrussParam {
	ForgeTypeId^ get ();
}
static member RoofRafterOrTrussParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace